{"title":"Litten的博客","description":"华中科技大学09级，就职于腾讯SNG。擅长各项前端技能，深入研究移动端开发与前端性能。非专业视觉设计师。此为博客一枚。","language":"","link":"//litten.me","pubDate":"Tue, 26 Sep 2017 04:31:22 GMT","lastBuildDate":"Wed, 08 Aug 2018 18:17:59 GMT","generator":"hexo-generator-json-feed","webMaster":"Litten","items":[{"title":"计算机基础03","link":"//litten.me/2017/09/26/计算机基础03/","description":"设置分栏效果：选择文字后，选择页面布局菜单中的页面设置，其中包含分栏选项，可以设置栏数、栏宽、栏距和分隔线，注意当创建分栏后，系统会自动为分栏的最后一个字符后设置分栏符设置分页符和分节符的操作：选择页面布局菜单中的页面设置，选择插入分页符和分节符选项，可以实现操作Word中常见分隔符详解：分页符：把标题放在页首或将表格完整放在一页，在分页位置插入分页符 Word文档正常是自动换行，自动分页，插入分页符则称为强制分页，分页的快捷键操作为ctrl+enter 分栏符：设置分栏后，Word自动添加一个分栏符，在每一栏的下方 换行符：排版需要会给标题设置一个比较大的段后间距，换行符添加没有分段且不用设置段落格式 Word中的分节符分节符的插入相当于在对应位置设置文档为两个不同的章节，可以具有不同的页面设置效果，成为相对独立的格式页主要操作包括：（1）下一页：光标当前位置后的全部内容移到下一个页面上 （2）连续：光标当前位置以后的内容将进行新的设置安排，单内容不转到下一页，而是从当前空白处开始 （3）偶数页/奇数页：光标当前位置以后的内容会转换到下一个偶数页/奇数页上，Word会在偶数页/奇数页之间自动空出一页 复制格式的操作方法包括：（1）使用格式刷：选中复制的格式文字，选择开始菜单中的剪切板选项中的格式刷，在设置格式的文字上拖选即可 （2）选中复制的格式文字，按ctrl+shift+c复制格式，选中被设置的文字，按ctrl+shift+v组合键粘贴格式 选择文件菜单中的打印选项，可以实现对应功能左侧进行打印设置（包括页面设置），右侧是打印预览，打印设置可以设置打印的范围，包括打印所有页、打印所选内容、打印当前页面、打印自定义范围（自定义范围主要是页数，分隔符包括-代表范围1-3表示打印1,2,3页，逗号的使用1,2则表示打印第一页和第二页），同时还可以是设置打印奇数页和偶数页效果等，并可以完成页面设置的相关操作Word中创建表格的方式：选择插入菜单中的表格，创建表格的方法有：（1）插入表格 （2）绘制表格 （3）文本转换成表格 （4）Excel电子表格 （5）快速表格 在创建表格后，系统会自动为表格创建设计和布局两个表格工具菜单，选择表格，选择设计菜单中的表格样式选项中的任意一种表格样式，即可实现样式的套用选择单元格的方式：（1）光标置于单元格内，则代表该单元格为活动单元格，右键选中“选择”选项中的单元格 （2）光标置于单元格内，选择布局菜单中的表选项中的选择中的选择单元格 选择行/列的方式：（1）光标置于行/列的任意一个单元格内，选择布局菜单中的表选项中的选择中的选择行/列 （2）光标置于行/列的任意一个单元格内，右键选中“选择”中的行/列 （3）鼠标置于行前，变为右指向的空心箭头时单击选定一行；鼠标置于列的第一个单元格上面，变为向下指向的实心箭头时单击选定一列 选择表格的操作：（1）光标置于当前表格任意单元格内，选择布局菜单中的表选项中的选择表格 （2）光标置于当前表格任意单元格内，右键选择“选择表格” (3)单击表格左上角的四向箭头选定表格 插入单元格的操作：选中一个单元格，右键选择插入选项中的单元格，实现插入单元格操作包括：活动单元格右移、活动单元格下移、整行插入和整列插入四种选择插入行/列的操作：（1）选择一行/列的某一个单元格，右键选择插入：选择在上方插入行/在下方插入行， 实现插入一行；选择在左侧插入列/在右侧插入列，实现插入一列 （2）选择一行/列的某一个单元格，选择布局菜单中的行和列选项，选择在上方插入/在下方插入， 实现插入一行；选择在左侧插入/在右侧插入，实现插入一列 设置单元格行高/列宽的方式： （1）选中单元格，选择布局菜单中的单元格大小选项，设置表格行高/表格列宽 （2）选中单元格，右键选择表格属性，在打开的对话框中，选择行选项，设置行高，选择列选项，设置列宽 （3）在单元格位置的边界线上，使用微调按钮实现改变行高/列宽 如果想要一次性插入多行，则可以选择多行，右键选择插入上方或下方插入行；一次性插入多列，则可以选择多列，右键选择插入左侧或右侧插入列删除单元格操作：选中单元格，右键选择删除单元格选项，方式包括：右侧单元格左移；下方单元格上移；删除整行；删除整列 还可以选择单元格后，选择布局菜单中的删除选项中的删除单元格操作 删除行/列的操作：（1）选中一行/一列，右键选择删除行/列操作 （2）选中一行或一列的任意一个单元格，右键选择删除单元格选项中的删除整行/删除整列 （3）选中一行或一列的任意一个单元格，选择布局菜单中的删除选项中的删除行/删除列 删除表格的操作：（1）选中表格，右键选择删除表格 （2）选中表格，选择布局菜单中的删除选项中的删除表格选项 （3）选中表格，按backspace键删除表格，注意此处如果按del键，则删除的不是表格，而是表格中的内容 合并/拆分单元格操作：（1）选择多个单元格，右键选择合并单元格；选择一个单元格，右键选择拆分单元格，指定行数和列数 （2）选择多个单元格，选择布局菜单中的合并选项中的合并单元格；选择一个单元格，在布局菜单中的合并选项中选择拆分单元格 设置表格的边框和底纹方法：（1）选中表格，右键选择边框和底纹 （2）选中表格，右键选择表格属性，在表格选项中选择边框和底纹 （3）选中表格，选择设计菜单中的表格样式选项中的边框或底纹设置 （4）选择表格，选择布局菜单中的表选项中的属性，打开对话框中选择表格选项中的边框和底纹设计 注意表格的边框和底纹设计选项应用，包括四种：文字、段落、单元格和表格表格中单元格的对齐方式设置：选择单元格，右键选择单元格对齐方式或选择单元格，选择布局菜单中的对齐方式设置单元格的对齐方式包括九种：靠上两端对齐、靠上居中对齐、靠上右对齐、中部两端对齐、 水平居中、中部右对齐、靠下两端对齐、靠下居中对齐和靠下右对齐 文字转换成表格的操作过程：输入文本数据，注意使用分隔符，选中文字，选择插入菜单中的表格选项中的“文本转换成表格”，发现对应表格的行数是固定的，列数是可改的，同时还可以设置分隔符位置，常见分隔符包括段落标记、逗号、空格、制表符等等，自动生成表格表格数据排序的过程：选择表格，选择布局菜单中的数据选项，选择排序，注意Word中的表格数据排序最多有三个关键字，分别为主要关键字、次要关键字和第三关键字，排序过程为首先按照主要关键字排序，如果出现重复值，则按照次要关键字排序，如果仍然重复，则按照第三关键字排序排序的类型包括笔划、拼音、数字和日期，排序的方式包括升序和降序两种表格执行公式运算的操作过程：选择表格中的单元格，选择布局菜单中的数据选项中的公式，一般公式的计算用方向实现，left针对左侧数据统计；right针对右侧数据统计；above针对上方数据统计；below针对下方数据统计，常用的函数包括sum求和、average求平均值、max求最大值、min求最小值、count求个数，注意除了用方向进行运算数据外，还可以使用Excel中的单元格地址区域注意插入到文档中的图片或图形，在插入完毕后，会自动产生格式菜单，菜单中可以设置效果，一般图片或图形的默认插入形式为嵌入型，同时要注意改变图片或图形的大小，无法改变图片或图形的内容；如果选择的是裁剪，则实现改变图片或图形的内容设置形状或文本框，右键设置形状格式，一般设置的包括线条样式和填充效果，线条为边框，填充为底纹，线条样式包括无线条、实线、渐变线三种；填充效果包括无填充、纯色填充、渐变填充、图片或纹理填充、图案填充等五种；插入文本框的操作：选择插入菜单中的文本选项中的文本框，文本框包括横排文本框和竖排文本框两种，文本框中可以插入图片，带有图片的文本框称为图文框设置脚注的方式：在原文中选择文字，选择引用菜单中的脚注选项中的插入脚注，则对应文字后面会自动出现阿拉伯数字序列，在当前页面页脚位置出现编辑光标，输入脚注内容即可，删除脚注的方法则需要在原文文字后删除对应脚注的序号（一般为按两次删除键），脚注自动编号脚注被设置在页面的页脚位置，因此称为脚注；尾注被设置在文档的结尾后面，因此称为尾注；注意尾注的编码格式为罗马字母，删除的方式与脚注相同批注相当于针对当前文档中存在的一些文字问题做说明解释或批阅信息设置，设置批注的方法为：选择文字，选择审阅菜单中的批注选项中的新建批注，则在框体内输入批注信息即可，删除批注则选择审阅菜单中的批注选项中的删除命令或选择批注后，右键选择删除批注均可在文档上如果想要设计目录，设计方式为在已经设置了标题样式、正文样式的文档基础上，将光标单独设置在一个空白页上（原因为该页作为目录页），选择引用菜单中的目录选项中的插入目录，则Word中的目录自动生成，如果想要访问目录中的具体某一部分内容，则按住ctrl键+鼠标点击该目录，则可以定位到原文中的位置如果目录信息有所改变，则可以选择引用菜单中的目录选项中的更新目录操作设置超链接的方式：选中文字后，选择插入菜单中的链接选项中的超链接，实现设置超链接连接，可以链接到文档中的文字（如标题、书签）位置，还可以链接其他的文件或网址。取消超链接的方式，选择设置了超链接的文字，右键选择取消超链接邮件合并设置了一个通用的模板，在模板中的大部分文字信息是固定的，只存在部分信息是不固定的，可以导入Excel表格的方式将其中的数据按照要求导入到对应的模板位置即可一般邮件合并的对象可以是信函、电子邮件、信封、标签、目录及普通的Word文档等Excel在使用Excel时，要注意Excel的保存文件类型为工作簿，扩展名为.xlsx（07及以后的版本）或.xls（03及以前的版本），Excel的主要功能为统计运算，在系统默认的情况下，Word文档的默认文件名为Doc1.docx，Excel表格的默认文件名为Book1.xlsx，工作簿包含了工作表，工作表中包含了单元格保存Excel文件的文件类型包括：.xlsx或.xls，.xltx(Excel的模板文件)、.txt(文本文档，使用制表符作为分隔符）、 .html或.htm（网页文件）和.pdf文件等格式 Excel在表示单元格时，使用的都是单元格地址，描述一个单元格地址，需要使用列号和行号，先说列号，再说行号，列号为英文字母组合，行号为阿拉伯数字活动单元格表示当前正在被使用的单元格向单元格输入数据：从上至下访问单元格按enter键； 从下至上访问单元格按shift+enter组合键 从左至右访问单元格按tab键 从右至左访问单元格按shift+tab组合键 在单元格中输入数据后，可以发现，如果输入的数据为文本型，则默认左对齐，如果输入的数据为数值型，则默认右对齐，那么如果想要将数值型数据转换为文本型数据，则可以在对应数据前加英文的单引号修饰，或者还可以选中单元格后，右键选择设置单元格格式，在数字中设置为文本型Excel中常见的错误类型：（1）###：代表输入到单元格中的数据过长或公式产生的数据结果过长，单元格当前大小无法容纳 （2）#N/A：在函数或公式中没有可用的数值 （3）#NAME？：当Excel不能识别公式中使用的文本时，出现该错误 （4）#DIV/0：代表除数为0或引用了信息为空的单元格 （5）#VALUE!：代表使用了错误的参数或运算对象的数据类型出错 （6）#REF!：代表引用的单元格无效 （7）#NUM!：函数或公式中的数字出现了问题 注意在一个单元格中，如果输入的数据超过11位长度，则自动系统会转入科学计数法显示数据结果单元格内表示负数的方法：在单元格中直接用负号（-）修饰数据表示为负数；或者用圆括号将数据值括起，表示结果为负数，如(9)=-9表示分数的方法：注意在一个单元格中如果想要表示分数，则输入1/2的结果显示为1月2日，此结果为系统默认结果；想要输入分数，则需要在分数前加0和空格，具体方式如输入二分之一，则方式为0 1/2表示日期时，使用的格式为：yyyy/mm/dd或yyyy-mm-dd，表示时间时，使用的格式为： hh:mm:ss am|pm Excel支持自动填充功能：自动填充的操作为：在一个单元格内输入数据值，单独选择该单元格，鼠标置于当前单元格右下角的填充位置拖动时实现的是相同数据值填充；在连续两个单元格内输入数据值，选择两个单元格，并拖拽填充，则自动出现等差数列；如果在一个单元格设置为文本型，且输入的数据为数值内容，则拖拽后自动填充等差数列Excel的自动填充功能在数据菜单中选择排序中的对话框，在其中找到自定义序列，可以发现自带有星期、月份、旬、天干、地支等选中一个单元格，输入数据会覆盖单元格中原有数据，此操作实现单元格数据的改写；双击一个单元格，则相当于编辑单元格，因此输入的数据会更新单元格原有数据值，还可以在选定单元格后，按F2功能键进行单元格数据编辑插入单元格操作：（1）选中单元格，右键选择插入 （2）选中单元格，选择开始菜单中的单元格选项中的插入中的插入单元格 注意插入单元格的操作方式与Word的操作方式相同，有4种插入行/列的方式：（1）选择行/列的任意一个单元格，右键选择插入，在打开的对话框中选择整行/整列 （2）选择行/列的任意一个单元格，选择开始菜单中的单元格选项中的插入的插入工作表行/插入工作表列 （3）单击行号位置，选定一行，右键选择插入，实现插入一行；单击列号位置，选定一列，右键选择插入，实现插入一列 注意默认情况下，插入的行在当前行的上方，插入的列在当前列的左侧 复制/移动单元格数据：（1）选择单元格，鼠标置于边框位置，直接拖动实现移动；按住ctrl键拖动实现复制 （2）选中单元格，按ctrl+c复制/ctrl+x剪切，找到指定位置，按ctrl+v粘贴，实现单元格数据复制/移动 （3）选中单元格，选择开始菜单中的剪贴板选项中的复制/剪切，到指定位置，选择剪贴板选项中的粘贴实现复制/移动 删除单元格/行/列操作：（1）选择单元格/在行号位置单击选定一行/在列号位置单击选定一列后，右键选择删除，实现删除单元格/行/列 （2）选择单元格/或选择一行或该行的单元格/选择一列或选择该列的单元格，在开始菜单中选择单元格选项中的删除选项，删除单元格/删除工作表行/删除工作表列 注意删除和清除是不同的，excel中的清除操作为：选择开始菜单中的编辑选项中的清除，清除的方式包括：全部清除、清除格式、清除内容、清除批注、清除超链接，但是如果选定了某一行/列/单元格，右键选择只能清除内容注意清除操作无法实现清除圈释标记，注意按del键，能够实现清除当前单元格内容，不能实现清除格式为工作表重命名的方法：（1）选中工作表名，右键选择重命名 （2）双击工作表名，重命名 （3）选中工作表名，选择开始菜单中的单元格选项中的格式选项中的重命名工作表 插入工作表的方法：（1）选中工作表名，右键选择插入，打开的对话框中选择工作表 （2）选中工作表名，选择开始菜单中的单元格选项中的插入中的插入工作表 （3）选中工作表名行，点击新的工作表标记新建工作表 （4）按shift+F11组合键 一个工作簿默认有三张工作表，工作表名为sheet1、sheet2和sheet3删除工作表操作：（1）选中工作表名，右键选择删除 （2）选择开始菜单中的单元格选项中的删除，删除工作表 移动/复制工作表操作：（1）选择工作表，在工作表名行鼠标直接拖动实现移动工作表位置；按住ctrl键并鼠标拖动实现复制工作表操作 （2）选择工作表，右键选择移动或复制，在打开的对话框中可以实现位置调整；选择建立副本即为工作表复制 （3）选择工作表，选择开始菜单中的单元格选项中的格式选项中的移动或复制工作表选项，同（2）操作 在不同的工作簿之间也可以实现工作表的移动和复制操作设置工作表行高/列宽的方式：（1）选择一行/一列，右键选择行高/列宽 （2）在对应的行或列的边线位置，用微调按钮实现调整行高或列宽的值 （3）选中行/列的单元格，选择开始菜单中的单元格选项中的格式中的行高/列宽 设置单元格格式的操作：（1）选定单元格，右键选择设置单元格格式 （2）选定单元格，选择开始菜单中的格式选项中的设置单元格格式","pubDate":"Tue, 26 Sep 2017 04:31:22 GMT","guid":"//litten.me/2017/09/26/计算机基础03/","category":""},{"title":"计算机基础02 ","link":"//litten.me/2017/09/26/计算机基础02/","description":"访问文件的方式包括绝对路径访问和相对路径访问Windows操作系统为多任务、单用户的操作系统，多任务代表可以同时在Windows打开多个应用程序运行，但是在多个应用程序中只有一个处于前台运行状态，其余应用程序处于后台运行状态处于windows桌面时，指向操作没有按键应用，单击代表选定，右击会出现快捷菜单，双击代表打开，双单击代表可以为应用程序重命名，如果使用开始菜单，则单击开始菜单中的应用程序为打开操作针对文件，左键拖动到指定位置可以实现文件的移动；右键拖动则可以实现文件复制或移动到指定位置选择应用程序的标题栏，右键单击会产生应用程序的控制菜单，控制菜单主要选项包括还原（显示应用程序窗口原大小）、移动、大小（可以调整大小）、最小化、最大化和关闭窗口与对话框的不同在于，窗口可以改变大小和位置，但是对话框只能改变位置，不可以改变大小常用的功能键包括：ctrl：控制操作 alt：激活操作 shift：做规则操作或连续选择操作等 切换应用程序窗口的操作：alt+tab：以应用程序图标方式切换 alt+esc：以应用程序窗口方式切换 计算机Windows操作系统的状态：（1）待机：除了内存以外其他设备均断电，所有程序停止运行（断网）， 切断电源则会丢失当前未保存的数据，恢复快，按任意键唤醒，恢复待机前状态，耗电 （2）休眠：内存数据全部存入硬盘后，所有设备断电，所有程序停止运行（断网），切断电源无影响， 恢复慢，和开机差不多，按开关唤醒，恢复为休眠前状态，不耗电 （3）睡眠：将内存数据保存后待机，结合两者优点，耗电 屏保：用于延长计算机显示器的寿命 启动任务管理器的操作：alt+ctrl+del组合键 在桌面任务栏应用中，任务栏可以改变宽度、改变位置，还可以改变任务栏中文字的大小 退出应用程序的方法： （1）单击标题栏中的关闭按钮 （2）选择文件菜单中的退出命令 （3）右键单击应用程序标题栏，在弹出的控制菜单中选择关闭 （4）在任务栏中选择应用程序，右键选择关闭操作 （5）双击标题栏中的应用程序图标 （6）alt+F4组合键 显示/隐藏文件扩展名的操作：在我的电脑中，选择组织菜单中的文件夹和搜索选项，选择查看选项卡，勾选隐藏已知文件类型的扩展名，则代表扩展名处于隐藏状态；不勾选则代表扩展名处于显示状态 文件的创建操作：文件的创建可以在右键菜单中选择新建创建，但是文件种类较少，最好的方式为选择开始菜单中所有程序中的具体程序，新建，但是需要设计文件存储路径文件的重命名操作：（1）选中文件，按F2功能键 （2）双单击文件重命名 （3）选中文件，右键选择重命名 （4）选中文件， 选择组织菜单中的重命名 文件的复制/移动操作： （1）选中文件，右键拖动实现复制/移动文件到当前位置操作 （2）选中文件，右键选择复制/剪切命令，到指定位置右键选择粘贴命令 （3）选中文件，在组织菜单中选择复制/剪切，到指定位置同样组织菜单中选择粘贴 （4）选中文件，按ctrl+c/ctrl+x复制，到指定位置按ctrl+v粘贴 （5）选中文件，按ctrl+鼠标拖动实现复制,直接拖动代表移动 （6）选中文件，在不同盘符下的拖动操作实现文件的复制，相同盘符下的拖动实现文件的移动效果 删除文件的操作： （1）选中文件，右键选择删除 （2）选中文件，在组织菜单中选择删除 （3）选中文件，按del键 以上三种方式删除的文件会置于回收站按shift+del实现彻底删除，清空回收站实现彻底删除控制面板是计算机配置软件、硬件的管理工具，打开控制面板的方式：（1）选择开始按钮，选择控制面板； （2）在我的电脑状态下，选择打开控制面板 显示器的类型包括CRT显示器和LCD显示器，CRT显示器的性能指标包括：分辨率，扫描频率，带宽，TCD认证LCD显示器的性能指标包括：响应时间，可视角度，点距，分辨率，刷新率，亮度，对比度等打印机的使用需要安装驱动程序，或者如果用户不安装打印机驱动，则可以与安装驱动的计算机实现网络资源共享（一定是局域网共享操作）画图软件的用法：选择开始菜单中的附件选项中的画图，保存文件的类型包括.bmp/.png/.jpg/.gif/.tiff等常见图像文件格式画图软件中可以实现设置文字、设置形状等常见的文字编辑软件包括：（1）记事本：做最基本的文字编辑，扩展名为.txt，只能设置字号、字体和字型 （2）写字板：可以实现一些常规的文字格式设置，扩展名为.rtf （3）Word：文档编辑软件，扩展名为.docx 注意：快捷菜单和快捷方式是不同的，快捷菜单是右键菜单，快捷方式是文件的快速访问方法 访问快捷菜单，则选中文件后右键弹出；设置快捷方式的方法： 选中文件，右键选择创建快捷方式或选中文件，右键选择发送到——桌面快捷方式 文件的属性包括：（1）系统属性：具有系统属性的文件，多半为系统文件，表示为S （2）隐藏属性：被隐藏操作的文件，看不到，表示为H （3）只读属性：不能被修改的文件，表示为R （4）存档属性：只是标记，无实际意义，表示为A 文件的基本状态包括只读和可读可写 Word的编辑状态包括两种：插入状态和改写状态，在系统默认情况下为插入状态，具体设置插入/改写的方式为：选择Word应用程序状态栏中的插入，单击变为改写；再单击变为插入 选择键盘上的insert键，单击变为改写、再单击变为插入 插入则代表在光标插入点处插入数据，改写则代表在光标插入点处输入的信息会改变插入点后面的文字 常见的快捷键应用： ctrl+n：新建文档 ctrl+o：打开文档 ctrl+s：保存文档 ctrl+p：打印文档 ctrl+c：复制文本 ctrl+v：粘贴文本 ctrl+x：剪切文本 ctrl+a：全选 ctrl+z：撤销操作 ctrl+y：恢复操作 ctrl+f：查找 ctrl+g：替换操作 ctrl+b：加粗 ctrl+u：加下划线 ctlr+i：倾斜 注意如果一个文档是新建状态，则点击标题栏中的保存按钮、点击文件菜单中的保存、另存为等操作，效果均相同； 如果一个已经存在的文件，点击标题栏中的保存按钮和文件菜单中的保存操作效果相同，但是与文件菜单中的另存为操作不同 Word中的标尺包括水平标尺和垂直标尺两种，Word中的视图包括四种，分别为页面视图、阅读版式视图、Web版式视图和大纲视图，在四种视图中，页面视图最为常用，包括水平标尺和垂直标尺显示，Web版式视图只能显示水平标尺，阅读版式视图和大纲视图中无法显示标尺Word文档的保存文件类型包括：.docx（Word2007以上版本文件）、.doc（Word2003以前版本文件）、 .txt、.rtf、.html（网页文件）、.pdf、 .xml（可扩展标记语言文件）、.dotx（Word的模板文件） 注意：Word的文件菜单中的关闭和退出命令效果不同，关闭代表当前Word文档内容关闭，但是不退出Word应用程序软件窗口；退出则代表退出应用程序窗口删除文字操作：在光标插入点位置，按backspace键删除光标前面的单个文字或字符； 按del键删除光标后面的单个文字或字符；按ctrl+backspace删除光标前面的一个英文单词或一个汉字词组； 按ctrl+del删除光标后面的一个英文单词或一个汉字词组 选择具体的文字信息，使用shift+向左/向右箭头即可，还可以用鼠标拖动法选定一行的操作：（1）将鼠标置于当前行行首位置，当鼠标形状变为向右指向的空心箭头时单击 （2）将光标置于当前行行首第一个文字前，按shift+end组合键选定一行 （3）将光标置于当前行行尾最后一个文字后，按shift+home组合键选定一行 选定一段的操作：（1）将鼠标置于当前段落任意一行的前面，当鼠标形状变为向右指向的空心箭头时，双击选定一段 （2）将光标置于当前段落任意位置，三击选定一段 （3）光标置于当前段落段首第一个文字前面，按住shift键点击段尾选中一段 （4）光标置于当前段落段尾最后一个文字后面，按住shift键点击段首选中一段 选定整篇文档：ctrl+a移动光标的操作：（1）将光标移动到当前行的行首位置，按home键实现 （2）将光标移动到当前航的行尾位置，按end键实现 （3）将光标移动到当前文档的开头位置，按ctrl+home实现 （4）将光标移动到当前文档的结尾位置，按ctrl+end实现 在Word中，可以按住alt键+鼠标拖动，选中一列，因此如果有题目说Word能够实现选择列字块，答案是正确的删除文字的方式除了可以使用del或backspace以外，还可以选择开始菜单中的清除命令中的清除内容，实现删除注意Word中的清除操作可以实现清除格式/清除内容Word默认的格式为两端对齐，宋体，五号字，无首行缩进Word中文本的复制/移动操作（1）选中文本，按住ctrl键拖动到指定位置实现文本复制；直接拖动到指定位置，实现文本移动 （2）选中文本，按ctrl+c复制/ctrl+x移动，到指定位置，按ctrl+v粘贴 （3）选中文本，选择开始菜单中的剪贴板选项中的复制/剪切命令，到指定位置，选择开始菜单中剪贴板中的粘贴命令 （4）选中文本，右键选择复制/剪切命令，到指定位置，右键选择粘贴 查找操作的应用：选择ctrl+F组合键打开查找对话框或选择开始菜单中的编辑选项中的查找中的高级查找查找可以查找内容，也可以查找格式或特殊格式，同时查找的方向可以向上、向下和全部查找，查找时可以全字匹配查找，还可以模糊查找，区分大小写查找等等多个文档想要同时查看的操作：选择视图菜单中的窗口选项中的并排查看，默认情况下，Word使用左右方式显示多个并排查看的文档，并排查看时还可以同步滚动字体的设置：选择开始菜单中的字体， 可以打开字体对话框（ctrl+d组合键）设置字体，包括设置字体样式，字号和字型注意选中文字则设置的字体是为选中文字设置的，未选中文字则设置的字体是为光标插入点之后的文字设置的设置字体包括设置中文字体和英文字体两种，字型包括常规、加粗、倾斜、加粗+倾斜四种，字号单位包括号和磅两种字符的间距是字体设置的，行与行之间的距离是段落设置的，字符间距包括的选择有三种：标准、加宽和紧缩Word中的段落设置：选择开始菜单中的段落选项，打开段落对话框，包含缩进和间距、换行和分页、中文版式三个选项在缩进和间距选项中，注意段落的对齐方式包括五种：左对齐、右对齐、居中、两端对齐和分散对齐缩进的设置可以设置左缩进、右缩进、悬挂缩进和首行缩进效果在设置间距时，可以在段落对话框中设置段前、段后间距，还可以设置行间距，选项包括单倍行距、1.5倍行距、2倍行距、多倍行距、最小值和固定值，注意最小值和固定值的单位为磅在段落的换行和分页选项中，分页的设置可以实现孤行控制、段前分页、与下段同页和段中不分页四种选择，在页面视图的水平标尺使用中，可以设置段落的缩进方式，左侧倒三角实现首行缩进效果，左侧正三角实现悬挂缩进效果，左侧小方块实现左缩进效果，右侧正三角实现右缩进效果在开始菜单中的段落选项中，还可以设置边框和底纹效果，打开的对话框中设置边框和底纹操作的对象可以是文字也可以是段落，还可以设置页面边框，选项包括整篇文档、本节、本节——仅首页；本节——除首页以外所有页设置首字下沉的方法：选中一段的第一个文字，选择插入菜单中的文本选项中的首字下沉，包含三个选择，无、下沉和悬挂，选择下沉后，在默认的情况下，下沉行数为3行在Word操作中，按enter键为硬回车操作，另起一段；按shift+enter键为软回车操作，在当前段另起一行在页面布局菜单中包括页面设置选项，可以设置纸张的大小、纸张的方向、页面的边距等，设置页面边距包括上下左右四个边距操作，还可以设置装订线，注意装订线位置包括左侧和上方两种，注意页面设置选项中还可以设置Word文档的页眉和页脚信息，同时可以指定当前文档每页多少行，每行多少字，但是不可以指定每页多少字Word中设置样式的方法：选择开始菜单中的样式选项，系统包含快速样式和更改样式两个选择，可以套用；（1）样式的新建 在样式选项中，打开样式对话框，选择新建样式按钮，在打开的对话框中设置新样式的属性，包括样式的名称、样式的类型、样式基准和后续段落样式，之后在当前对话框的左下角包含格式，打开后可以设置自定义格式多项，设置完成后确定 （2）样式的使用 选中文章中的文字，点击样式管理器中的自定义样式即可实现样式套用 （3）样式的修改 选择样式管理器中的自定义样式，右键选择修改，重新设置样式内容即可 （4）样式的删除 选择样式管理器中的自定义样式，右键选择删除样式 在Word中，选择页面布局菜单中的页面背景，可以设置水印效果，水印包括无水印、图片水印和文字水印三种，其中文字水印可以设置文字的字体、字号和字体颜色，还可以设置字体显示的版式，版式包括斜式和水平两种设置页面边框的方式：（1）选择开始菜单中段落选项中的边框和底纹选项中的页面边框 （2）选择页面布局菜单中的页面背景选项中的页面边框 设置页眉和页脚： 选择插入菜单中的页眉和页脚选项，在选项中选择页眉，编辑页眉设置页眉操作样式， 选择页脚，编辑页脚设置页脚内容，退出页眉和页脚的编辑操作，双击正文即可，编辑页眉和页脚，则双击页眉和页脚位置即可 注意一般页脚的设计内容为页码，那么页码的选项包括设置起始页码和续前节 插图操作：选择插入菜单中的插图选项，其中包含插入图片、剪贴画、形状、SmartArt、图表和屏幕截图，注意图片来自文件，SmartArt称为组织结构图，图表必须有Excel的表格数据做支撑，屏幕截图一定是除了当前正在编辑的Word文档以外的其他已打开的应用程序窗口插入形状时，做规则图形按shift键+鼠标拖动，形状的位置微调按ctrl+上下左右箭头，形状的大小微调按alt+鼠标拖动","pubDate":"Tue, 26 Sep 2017 04:24:45 GMT","guid":"//litten.me/2017/09/26/计算机基础02/","category":""},{"title":"数据库04","link":"//litten.me/2017/09/26/数据库04/","description":"SQL Server的服务：必须让SQL Server的服务处于启动状态，才可以正常使用SSMS 在启动服务时，其应用为选择控制面板中的管理工具，其中有服务的选项，在服务中将SQL Express，右键手动启动即可 SQL Server中的数据类型1、数值型####（1）整型 bit：位型，其操作数据的值只有两个，1或0，占1位 tinyint：小整数，值为0~255，占1个字节 smallint：短整数，值占2个字节 int：整型，占4个字节 bigint：长整型，占8个字节 注意所有整型数据在用时，均无需设置长度，长度系统默认给出 （2）浮点型表示小数，小数包括一种有限小数，一种是无限小数，有限小数在SQL Server中称为精确数值型，无限小数即为浮点型 精确数值型包括： decimal numeric 两种精确数值型的操作方式相同，使用也相同，均为decimal(p,s)，numeric(p,s)， 其中的p代表精度，s代表小数位数，精度里面包含小数点占1位，同时需要注意四舍五入问题 如：declare @a decimal(5,2) set @a=34.567 select @a 答案为34.57 无限小数包括float和real，一般在操作时，直接使用即可，长度是系统默认给的，无需设置 2、字符型####（1）char 称为定长字符型，对应字符型数据一般是需要使用者给定字符长度的， 设定长度的方式为char(整数值)，在应用中，要注意所谓char的定长字符型， 其操作为设定了整数值为多少，则对应输入的数据就会占据整数值个长度， 不足位则对应数值后补空格，超长则多余部分从尾部截取 在SQL Server中，所有字符型数据均需要用单引号修饰 declare @a char(4) set @a=’abcde’ select @a 答案：abcd declare @a char(4) set @a=’abc’ select @a+’d’ 答案：abc d （2）变长字符型varchar 也是需要给出长度的，在应用中，要注意所谓varchar的变长字符型， 其操作为设定了整数值为多少，则对应输入的数据就会占据整数值个长度， 不足位则无操作，保留数值本身；超长则多余部分从尾部截取 declare @a varchar(4) set @a=&apos;abcde&apos; select @a 答案：abcd declare @a varchar(4) set @a=&apos;abc&apos; select @a+&apos;d&apos; 答案：abcd （3）text：文本型，代表的数据如果过长，则需要使用text，char型和varchar型均无法正常表示，text如设置个人简历等内容较多的文本 使用text数据类型，无需设置长度 3、货币型money smallmoney 类似于数值型，做正常使用，无需设置长度 4、日期时间型smalldatetime：占4个字节，能够精确到分钟 datetime：占8个字节，能够精确到毫秒 该数据类型在使用时，无需设置长度 变量、运算符和表达式（1）在SQL Server中的变量类型包括两种：全局变量和局部变量，全局变量用@@开头，局部变量用@开头 常用的程序中包括两种标识符，一种为变量， 即在程序运行过程中其值可以发生改变的则称为变量；在程序运行过程中，其值不可以发生变化的称为常量 变量的操作需要经历先定义后赋值的过程 变量的定义： declare @变量名 数据类型(宽度) 变量的赋值： 方式有两种，可以使用set或select赋值 set @变量名=变量值 注意此操作只能一次为一个变量赋值 select @变量名1=变量值1,@变量名2=变量值2,... 注意此操作能够为多个变量进行赋值 变量的输出操作包括两种： select @变量名1,@变量名2,... 此操作能够以表格方式输出结果 print @变量名1,@变量名2,... 此操作能够以打印方式输出结果 在操作中可以发现，定义变量、变量赋值和变量输出的操作单独运行时， 只有定义变量的无问题，剩余均出错，则代表该变量的使用过程应该是一个完整的操作过程， 要一起运行，在SQL Server中被称为是一个批处理 （2）运算符算术运算符 + - * / % 注意/的操作：两个整数进行相除操作，答案也是一个整数 %求余数，保证操作数为整数 赋值运算符 = 在SQL Server中，等号既可以做赋值运算符，也可以做比较运算符 赋值运算符的使用为：将=右侧的值为=左侧的值赋值 比较运算符 &gt; &gt;= &lt; &lt;= = !=(不等于) &lt;&gt;(不等于) 运算结果为逻辑型，true代表结果为真，false代表结果为假 逻辑运算符 逻辑与and：操作原则为前后连接两个关系运算，遇假则假 逻辑或or：操作原则为前后连接两个关系运算，遇真则真 逻辑非not：操作原则为其后连接一个关系运算，遇真则假，遇假则真 字符串连接运算符+ 前后连接两个字符串型数据，用+代表连接 在多种运算符应用中，运算符的优先级别设计为首先做算术运算（先做* / %，再做+ -)， 再做字符串连接运算，再做比较运算，再做逻辑非，再做逻辑与，再做逻辑或，再做赋值操作， 但是使用圆括号可以改变优先级，圆括号的优先级高于一切，注意同级别的运算符如果同时出现，运算顺序为从左到右 SQL中的流程控制语句结构顺序结构 选择结构 循环结构 1、顺序结构所谓顺序结构，代表程序中的所有语句自上而下逐条运行在程序设计中，一定要注意数据类型必须统一，字符型和数值型是无法在一个表达式中直接运算的，必须转换为相同的数据类型，一般是将数值型转换为字符型操作数据类型转换使用转换函数，包括cast和convert两种，具体用法为：cast(表达式 as 数据类型) convert(数据类型,表达式) 注意如果数据类型中包含了长度设计，则直接给出即可 SQL Server中的函数1、数学函数（1）abs(数值n)：取n的绝对值函数 （2）rand()：是一个随机函数，返回值为0~1之间的随机浮点数 （3）sqrt（数值n）：平方根函数 （4）square(数值n)：平方函数 （5）round(数值n，整数m)：四舍五入函数，针对数值n的小数部分保留m位有效小数 例如：select round(456.789,2) 答案为456.790 （6）ceiling(数值n)：取上界，大于等于n的最小整数 （7）floor(数值n)：取下界，小于等于n的最大整数 注意在取上下界的过程中，如果操作数是一个整数，那么该整数的上界和下界均是本身 （8）power(数值n，整数m)：返回n的m次方 （9）pi()：返回圆周率的值 （10）sign(数值n)：返回n的符号，如果n为正数，则返回1，如果n为负数，则返回-1，如果n为0，则返回0 2、字符串函数（1）ascii(字符串s)：返回字符串s中首字母的ascii码值 （2）char(整数n)：返回ascii码值为n的对应字符 （3）charindex(字符串s1，字符串s)：返回字符串s1在字符串s中首次出现时首字母的位置，如果没有在s中出现，则返回值为0 select charindex(&apos;ab&apos;,&apos;mnq&apos;) 答案为0,因为ab不是mnq的子串 select charindex(&apos;mn&apos;,&apos;mnq&apos;) 答案1，因为sql server的字符串下标从1开始 select charindex(&apos;mn&apos;,&apos;mnqmn&apos;) 答案为1，因为返回的是mn在mnqmn中首次出现的首字符的位置 （4）left(字符串s,整数n)：针对字符串s从左侧开始取n个长度的子串 （5）right(字符串s，整数n)：针对字符串s从右侧开始取n个长度的子串，注意操作结果为从左到右显示，不是逆序 （6）substring(字符串s，整数m，整数n)：针对字符串s从m位置开始取n个长度的子串 （7）len(字符串s)：求字符串s的长度 datalength(字符串s)：求字符串s的字节数 注意一个汉字占2个字节，但是len无汉字和字符之分，均按照1个字符统计；datalength则按照具体的内存空间占有进行统计 select len(&apos;ab&apos;) 答案为2 select datalength(&apos;ab&apos;) 答案为2 select len(&apos;中国&apos;) 答案为2 select datalength(&apos;中国&apos;) 答案为4 （8）upper(字符串s)：将字符串中所有小写字符变为大写字符输出 （9）lower(字符串s)：将字符串s中所有大写字符变为小写字符输出 （10）replace(字符串s，字符串s1，字符串s2)：将字符串s中的字符串s1，由字符串s2替换，注意有几个s1，就替换成几个s2","pubDate":"Tue, 26 Sep 2017 04:01:00 GMT","guid":"//litten.me/2017/09/26/数据库04/","category":""},{"title":"数据库03","link":"//litten.me/2017/09/26/数据库03/","description":"主要针对关系的规范化1NF：只要属性不可再分则实现1NF 2NF：在1NF的基础上，去掉部分函数依赖 3NF：在2NF的基础上，去掉传递函数依赖 BCNF：去掉所有非主属性对主属性的依赖关系 某商店的业务描述如下： （1）每一张发票有唯一的发票编号； 发票主码为发票编码 （2）一张发票可以购买多种商品，不同的发票可以购买同一种商品； 发票：商品 多对多 （3）一个厂商可以供应多种商品，一个商品可以由多家厂商供应； 厂商： 商品 多对多 （4）每一个厂商和每一种商品有唯一的编号 厂商编号和商品编号为主码 根据上述业务规则得到商品厂商发票关系模式R（发票编号，日期，厂商编号，厂商名称，商品编号，商品名称，定价，数量） 试求：① 写出R的基本函数依赖集F，求R的候选键,判断R的规范化范式级别。 ② 将R规范到BCNF范式。 R的候选键发票编号+商品编号+厂商编号，原因是多对多的联系，两个实体集的主码共同做联系的关系模式的主码，由于发票和商品之间为多对多联系，因此联系的主码为发票编号+商品编号；由于厂商和商品之间为多对多联系，因此联系的主码为商品编号+厂商编号，因此两个联系放在一个关系模式集中，则主码为发票编号+商品编号+厂商编号。从当前例子中可以发现，日期是由发票编号决定的，因为开发票是需要设置日期的；厂商名称是由厂商编号决定的；商品名称和单价是由商品编号决定的；数量，则是在具体的某一张发票上，某厂商订购某商品的数量值，因此是由发票编号+厂商编号+商品编号共同决定的因此从当前的例子中可以发现，存在部分函数依赖关系，所以当前的关系模式函数依赖集合只满足1NF的规范化 R1(发票编号,厂商编号,商品编号，数量) R2(发票编号，日期) R3(厂商编号，厂商名称) R4(商品编号，商品名称，定价) 某企业集团有若干工厂，每工厂生产多种产品，且每种产品可以在多个工厂生产， 每个工厂按照固定的计划数量生产产品；每个工厂聘用多名职工，且每名职工只能在一个工厂工作， 工厂聘用职工有聘期和工资。工厂属性有工厂编号、厂名、地址， 产品的属性有产品编号、产品名、规格，职工的属性有职工号、姓名。 (1) 根据上述语义画出ER图，在ER图中需注明实体的属性、联系的类型及实体的标识符。工厂(工厂编号,厂名,地址) 主键工厂编号 产品(产品编号，产品名，规格) 主键产品编号 职工（职工号，姓名） 主键职工号 生产(工厂编号，产品编号，计划数量) 主码为工厂编号+产品编号，外码为工厂编号，产品编号 聘用(职工号，工厂编号，聘期，工资) 主码职工号，外码是工厂编号 分析后，发现所有的关系模式均达到3NF (2) 将ER模型转换成关系模型，并指出每个关系模式的主键和外键。(3) 分析每个关系模式已经达到第几范式，并完成3NF的规范化要求 某连锁商店数据库中有三个实体集。 “商店”实体集；“职工”实体集；“商品”实体集。业务规则如下： 一个商店有若干职工，每个职工只能在一个商店工作；职工在商店工作有聘用日期、月薪等属性； 商店可以销售多种商品，统计月商品销售量。（自定义属性） 商店（商店编号，商店名称，地址） 主码为商店编号 商品（商品编号，商品名称，单价） 主码为商品编号 职工（职工编号，姓名，性别，出生日期，电话） 主码为职工编号 聘用（职工编号，商店编号，聘用日期，月薪） 主码为职工编号，外码为商店编号 销售（商店编号，商品编号，月商品销售量） 主码为商店编号+商品编号，外码为商店编号，商品编号 每一个关系模式均达到3NF 需要注意在关系模式转换过程中，一定要保证当前原有的题目中没有单独设计的关系模式（即没有独立存在与其他的关系模式无关的关系模式）定义，否则出错试根据上述业务规则： ① 设计E-R模型。② 将E-R模型转换成关系模式集，并指出主码和外码，并转换为3NF 某书店的业务描述如下： （1）每一个订单有唯一的订单编号； 订单编号是订单的主码 （2）一个订单可以订购多种图书，不同的订单可以订购同一种图书； 订单和图书为多对多联系 （3）一个订单只对应一个客户，一个客户可以有多个订单； 订单和客户之间为一对多联系，客户是1，订单是多 （4）每一个客户和每种图书均有唯一的编号 客户编号和图书编号为主码 根据上述业务规则得到商品订单关系模式R: R（订单编号，日期，客户编号，客户名称，客户电话，图书编号，图书名称，定价，数量） 分析本题目，订单和图书之间为多对多联系，因此联系的主码为订单编号+图书编号，但是订单和客户为一对多联系，因此一对多联系中，联系的主码应该为多端实体集的主码，即订单编号，因此对应商品订单关系模式R的候选键应该为订单编号+图书编号由于当前的关系模式R中，候选键的一部分订单编号决定了日期，客户编号；图书编号决定了图书名称和单价，因此存在部分函数依赖关系，同时客户编号决定了客户名称和客户电话，因此订单编号间接决定了客户名称和客户电话，因此该关系中还存在传递函数依赖关系，当前关系模式满足属性不可再分的1NF的规范化要求R1(订单编号，图书编号，数量) 主码是订单编号+图书编号，外码是订单编号，图书编号 R2(订单编号，日期，客户编号) 主码是订单编号，外码是客户编号 R3(图书编号，图书名称，定价) 主码是图书编号 R4(客户编号，客户名称，客户电话) 主码客户编号 部分函数依赖关系要注意将候选键的子集依次创建一个单独的关系模式，将决定的属性写在对应关系模式中即可；传递函数依赖关系则注意将传递函数依赖决定的属性剔除，单独创建关系模式，将将传递函数依赖决定的直接属性置于这个单独创建的关系模式中做主码试求：① 写出R的基本函数依赖集F，并求出R的候选键。 ② 判断R的规范化范式级别。 ③ 若R不满足3NF范式，将R规范到3NF范式。 设物资管理数据库中有两个实体集。一是“仓库”实体集，具有仓库号、地址、电话等属性；另一个是“零件”实体集，具有零件号、零件名称、规格、单价等属性。如果规定：一种零件可以存放在多个仓库中，一个仓库可以存放多种零件。存放在仓库中的零件有存放日期、库存量。仓库(仓库号，地址，电话) 主码是仓库号 零件（零件号，零件名称，规格，单价） 主码是零件号 存放（零件号，仓库号，存放日期，库存量） 主码是零件号+仓库号，外码是零件号，仓库号 每一个关系模式均达到3NF要求 (2)将E-R图转换成关系模型，并注明每个表的主码与外码 假设某商业集团数据库中有关系模式R 如下： R (商店编号,商品编号,数量,部门编号,负责人) 如果规定： (1) 每个商店的每种商品只在一个部门销售； 商店编号+商品编号，决定了部门编号 (2) 每个商店的每个部门只有一个负责人； 部门编号决定了负责人 (3) 每个商店的每种商品只有一个库存数量。 商店编号+商品编号，决定了库存数量 候选键为商店编号+商品编号 从（1）条件可以发现，每个商店的每种商品只在一个部门销售，则代表商店编号+商品编号决定了部门编号；从（2）条件可以发现，部门编号决定了部门的负责人；从（3）条件可以发现，每个商店的每种商品只有一个库存两，因此商店编号+商品编号决定了库存数量由此商店编号+商品编号，分别决定了部门编号和库存数量，但是部门编号决定了负责人，因此该关系模式本身已经实现2NF（因为关系模式中不存在部分函数依赖关系），但是不满足3NF（因为存在传递函数依赖关系） R1(商店编号,商品编号,数量,部门编号) 主键是商品编号+商店编号，外码为部门编号 R2(部门编号,负责人) 主码为部门编号 试回答下列问题： (1) 根据上述规定，写出关系模式R 的基本函数依赖； (2) 找出关系模式R 的候选码； (3) 试问关系模式R 最高已经达到第几范式？为什么？ (4) 如果R 不属于3NF，请将R 分解成3NF 模式集。 书店的业务描述： （1）每一个订单有惟一的订单编号； 订单编号为主码 （2）一个订单可以订购多种图书，且每一种图书可以在多个订单中出现； 订单和图书为多对多联系 （3）一个订单对应一个客户，且一个客户可以有多个订单； 订单和客户为一对多联系，客户为1，订单为n （4）每一个客户有惟一的客户编号； 客户编号为主码 （5）每一种图书有惟一的图书编号。 图书编号为主码 根据上述业务描述和订单格式得到关系模式R R（订单编号，日期，客户编号，客户名称，客户电话，地址，图书编号，书名，定价，数量） 候选键应该是订单编号+图书编号 R1(订单编号,图书编号，数量) 主键是订单编号+图书编号，外键为订单编号，图书编号 R2(订单编号，日期，客户编号) 主键为订单编号，外键为客户编号 R3(图书编号，书名，定价) 主键为图书编号 R4(客户编号，客户名称，客户电话，地址) 主键为客户编号 问：（1）写出R的基本函数依赖集。 （2）找出R的候选键。 （3）判断R最高可达到第几范式，转成3NF （4）将R分解为一组满足3NF的模式。 9.设有关系模式： 教师授课（课程号，课程名，学分，授课教师号，教师名，授课时数）， 其语义为：一门课程（由课程号决定）有确定的课程名和学分，每名教师（由教师号决定）有确定的教师名， 每门课程可以由多名教师讲授，每名教师也可以讲授多门课程，每名教师对每门课程有确定的授课时数。 指出此关系模式的候选码，判断次关系模式属于第几范式，若不属于第三范式，请将其规范化为第三范式关系模式， 并指出分解后的每个关系模式的主码和外码 课程号决定课程名和学分 教师号决定了教师名 教师和课之间是多对多联系，那么主码应该为教师号+课程号 教师授课（课程号，课程名，学分，授课教师号，教师名，授课时数） R1(课程号，授课教师号，授课时数) 主码课程号+教师号，外码是课程号，教师号 R2(课程号，课程名，学分) 主码是课程号 R3(授课教师号，教师名) 主码是教师号","pubDate":"Tue, 26 Sep 2017 03:48:33 GMT","guid":"//litten.me/2017/09/26/数据库03/","category":""},{"title":"数据库02","link":"//litten.me/2017/09/26/数据库02/","description":"关系运算：（1）交：存在两个关系R和S，注意两个关系必须具有相同的属性列表，交操作结果为既属于R也属于S的元组集合，组成一个新的关系 （2）并：存在两个关系R和S，注意两个关系必须具有相同的属性列表，并操作结果为属于R或者属于S的元组集合，组成一个新的关系 （3）差：存在两个关系R和S，注意两个关系必须具有相同的属性列表，差操作结果为属于R但不属于S的元组集合，组成一个新的关系 （4）笛卡尔乘积：存在两个关系R和S，将 R×S的结果为笛卡尔乘积，结果中做两个关系属性的加法，元组的乘法，例如关系R包含m1个属性，n1个元组，S包含m2个属性，n2个元组，则R×S的结果包含m1+m2个属性，n1*n2个元组 注意笛卡尔乘积的两个关系可以不具有相同的属性列集 （5）选择操作：选择也称为限制，在关系R中选择满足指定条件的元组 σ条件(关系) 实际上就是从关系中查找满足条件的子关系内容 （6）投影操作：从对应关系中选择出某一些具体的属性组成一个新的关系作为结果 ∏属性列表(关系)（7）连接操作 连接操作为θ连接，从两个关系的笛卡尔乘积中选取属性间满足一定条件的元组，组成一个新的关系作为结果、 连接分为两种，等值连接和不等值连接，不等值连接则代表条件是不等于相关的比较符号，等值连接则代表条件是相同的操作关系，等值连接又包括等值连接和自然连接两种 等值连接直接按照相等条件连接即可，自然连接是特殊的等值连接，将两个关系中进行比较的必须是相同的属性，并且要在结果中将重复的属性去掉 关系的完整性操作包括三种类型，分别是实体完整性，用户自定义完整性和参照完整性 1、实体完整性 也称为行完整性，能够实现对应关系中的每一行唯一确定值，实现实体完整性的操作包括设置主键、设置唯一约束和设置索引 2、用户自定义完整性 也称为列完整性，也称为域完整性，能够实现在某一具体列（属性）上的域设置范围，实现用户自定义完整性的操作包括设置规则和默认值约束条件 3、参照完整性 设置参照完整性的应用，即在主从两表上，主表需要设置主键，从表需要设置外键，从表的信息要随着主表信息的修改而修改 关系的规范化理论关系规范化即为了创建数据库中的关系时，一定要尽量减少数据冗余情况和可能发生的异常情况关系规范化的主要解决问题为：（1）数据冗余 （2）插入数据异常 （3）更新数据异常 （4）删除数据异常 函数依赖如果存在关系R（U），注意U代表关系的属性集，X和Y分别是U的子集， 存在对于R(U)的任意一个可能的关系r，r中不可能存在两个元组在X上的属性值相等，而Y上的属性值不等，则称X函数决定Y函数，或Y函数依赖于X，X-&gt;Y 学生(学号,姓名,性别,出生日期) 注意学号决定了姓名，性别和出生日期，因此为函数依赖关系，X属性集为学号， Y属性集为姓名，性别和出生日期。在整个关系模式中，非学号的其他所有属性均由学号主关键字决定， 因此也可以被称为是完全函数依赖关系 部分函数依赖如果针对一个关系模式，存在子属性集X函数依赖决定Y，X的子集函数依赖决定Y&apos;，则代表该关系中存在部分函数依赖 选课(学号,课程号,成绩,姓名) 该关系模式主码为学号和课程号共同实现主码，学号和课程号决定了学生成绩，但是主码的一部分学号决定了姓名，因此存在部分函数依赖关系 传递函数依赖如果存在子属性集X函数依赖决定Y，而Y函数依赖决定Z，那么X传递函数依赖决定Z 学生(学号,姓名,所在系,系主任) 学号决定了学生的姓名和所在系，但是所在系决定了系主任，因此学号被传递决定了系主任，因此系主任传递函数依赖于学号 第一范式（1NF）设定存在关系R，如果关系R中的所有属性均不可再分，则实现满足1NF的要求，此要求是关系规范化的最低要求 第二范式(2NF)设定存在关系R，在满足1NF的前提下，如果关系中存在部分函数依赖，将部分函数依赖关系全部清除后，实现第二范式的规范化要求 将1NF的规范化进行2NF规范化处理的过程： （1）将对应关系模式的每一个主关键字的子集均单独创建一个关系模式 （2）将每一个关系模式的完全函数依赖属性设置在对应关系模式中 （3）去掉除了主关键字子集属性外，没有其他属性的关系模式即可 第三范式(3NF)设定存在关系R，在满足2NF的基础上，如果关系中存在传递函数依赖关系，将传递函数依赖关系去除，则称为满足3NF规范化要求 将2NF的关系进行#NF规范化处理的过程： （1）将传递函数依赖的属性在对应关系模式中去掉，将决定该属性的属性单独设计关系模式 （2）将传递函数依赖的属性写在决定属性设计的新关系模式里 学生(学号,姓名,所在系) R(所在系,系主任) BC范式（BCNF）在关系模式的设计中，如果不是每一个决定因素都包含关键字，则不满足BCNF，即设定存在关系R， 则关系R中的所有属性均不传递函数依赖于每一个候选码，即消除属性对候选码的传递函数依赖即为满足BCNF 某医院住院部业务如下： （1）一个病人只有一位主治医生，每一位主治医生可以治疗多位病人； （2）一个病房可多位患者，一个患者可以多次住院； （3）病人的属性有患者编号、姓名、性别、年龄，医生的属性有医生编号、姓名、 职务，病房的属性有病房编号、科室。 试根据上述业务规则：① 设计E-R模型。② 将E-R模型转换成关系模式集。 患者(患者编号,姓名,性别,年龄) 主码是患者编号 医生(医生编号,姓名,职务) 主码是医生编号 治疗(患者编号,医生编号,病历) 主码是患者编号，外码是医生编号 病房(病房编号,科室) 主码是病房编号 住院(患者编号,病房编号,住院时间,出院时间) 主码是患者编号+病房编号，外码是患者编号，病房编号","pubDate":"Tue, 26 Sep 2017 03:42:21 GMT","guid":"//litten.me/2017/09/26/数据库02/","category":""},{"title":"数据库","link":"//litten.me/2017/09/26/数据库/","description":"数据管理技术发展的三个阶段：（1）人工管理阶段 （2）文件系统管理阶段 （3）数据库管理阶段 数据库，Database，简称DB，大量数据的集合 数据库管理系统，Database Management System，简称DBMS，是位于用户和操作系统之间的一级系统软件，用于实现数据库管理操作，是数据库系统的核心数据库系统，Database System，简称DBS，数据库系统由数据库、数据库管理系统、计算机、用户及数据库管理员（DBA）组成 DBMS的主要操作内容包括：（1）数据定义 create（创建数据库对象）、alter(修改数据库对象)、drop（删除数据库对象） （2）数据操纵 insert（插入数据）、update（更新数据）、delete（删除数据） （3）数据查询 select （4）数据控制 grant（授予权限）、revoke（收回权限） 数据库系统的体系结构：主要采用客户机/服务器的工作原理，简称C/S 除此之外，常见的工作模式还包括B/S，此处所说B代表Browser，浏览器；S代表Server，服务器 数据库体系结构：三级模式/两级映射设计数据库的体系结构首先要有用户需求，例如设计实现学生成绩管理系统, 首先需要针对用户的需求进行分析，分析数据包括有哪些具体组成以及基本的数据元素，在需求分析阶段产物为数据字典（简称DD），需要将需求分析的结果转换为存储在计算机中的数据实体，因此中间过程，将需求分析结果进行人脑的客观反应，产生概念模型设计，在概念模型设计中以E-R图（也称为实体-联系模型）展示数据库中数据之间的关系；将E-R图转换为数据库还需要中间过程，将概念模型转换为逻辑模型，逻辑模型的产物为关系模式，逻辑模型实际上就是对整体用户需求的一个完整的描述，因此称为逻辑模式或模式，逻辑模型最终会直接转换为计算机的内部存储，称为物理模型，内部存储为内模式，逻辑模型的设计实际上是面向外部用户应用的，外部应用称为外模式，由于外部应用可能有多个，因此外模式有多个，在模式和外模式、模式和内模式之间分别存在一级映射关系，因此数据库系统结构被称作三级模式/两级映射 数据模型的三要素：数据结构、数据操作和数据约束（1）数据结构：在数据库中，存储了具体哪些数据库对象即为数据结构 （2）数据操作：是数据操作的核心内容，包括增加、删除、更改、查询 （3）数据约束：描述数据结构内数据间的语法、语义联系，一定要满足的条件 一般来说，数据约束即为数据完整性操作 数据库建模: 概念模型的设计 概念模型是人脑对数据库需求的抽象反应概念模型中的主要概念包括：（1）实体：客观存在的可以相互区分的事物 实体也可以是抽象的概念 （2）实体集：同类实体的集合称为实体集 （3）属性：实体所具有的某一方面的特性 （4）域：属性的取值范围称之为域 （5）联系：实体与实体之间的关系称为联系，注意在一个数据库中，所有的实体之间或直接或间接一定会存在联系，否则无法实现一个数据库系统的设计 联系的类型分为三种，分别为一对一联系（1:1），一对多联系(1:n)，多对多联系(m:n) 1:1联系：存在两个实体集A和B，如果针对实体集A中的任意一个实体，在实体集B中至多有一个实体与之对应，反之，在实体集B中的任意一个实体，实体集A中也至多有一个实体与之对应，则称实体集A和B为一对一联系例如：国家和首都，班级和班长 1:n联系：存在两个实体集A和B，如果针对实体集A中的任意一个实体，在实体集B中至多有一个实体与之对应，反之，在实体集B中的任意一个实体，在实体集A中有多个实体与之对应，则称实体集A和B为一对多联系，注意在数据库中不存在多对一联系例如：教师和学生注意在很多情况下，联系只是在一定条件满足的情况下实现的联系类型确定，不一定绝对 m:n联系：存在两个实体集A和B，如果针对实体集A中的任意一个实体，在实体集B中有多个实体与之对应，反之实体集B中的任意一个实体，在实体集A中有多个实体与之对应，则称实体集A和B为多对多联系例如：学生和课程，读者和书籍 （6）唯一标识符：如果在一个实体集中存在一个属性或属性的组合能够唯一性确定实体集中每一个实体，则称该属性或属性的组合为唯一标识符，也可以看做是关键字，称为码或键 （7）候选关键字：概念与唯一标识符或关键字的概念相同，也称为候选码或候选键 （8）主关键字：在候选关键字中，找到最能够代表实体集特点的候选关键字作为主关键字，也称为主码或主键 注意唯一标识符、关键字、候选关键字可以有多个，但是主关键字只能有一个 注意主关键字的要求是不允许对应属性或属性的组合上存在重复值或空值 （9）主属性：候选关键字中的属性称为主属性 （10）非主属性：不在候选关键字中的属性称为非主属性 概念模型的设计产物为E-R图，也称为实体-联系模型，对应E-R图包含三要素，分别是实体、联系和属性，在E-R图的设计中，需要将数据库系统中所有的三部分信息全部描述清楚####E-R图设计的具体步骤： （1）用矩形框表示实体集 （2）用椭圆形表示属性 （3）用菱形表示联系 （4）将联系的类型在连接线上标注出来 （5）标注出每一个实体集的主码在绘制E-R图的过程中，还需要掌握E-R图中各个基本元素的结构分析，是属性，还是实体集，还是联系，同时也要注意结构的归属问题，是属于实体集的，还是联系产生的自身属性 概念模型转换为逻辑模型的过程，是将图形转换为关系的过程，逻辑模型的产物为关系模式，也称为关系，关系模式的样式为：关系模式名(属性1,属性2,…) 在概念模型的E-R图转换为逻辑模型的关系模式过程中，注意每一个实体集均需要单独对应一个关系模式。但是如果将概念模型转换为逻辑模型时，只转换实体集，则还缺少关于联系的转换操作，E-R图中的联系转换为关系模式时，需要根据不同的联系类型进行不同的转换操作 如果存在一个属性或属性的组合在一个关系模式A中作为主码设置，在另一个关系模式B中作为普通属性设置，则称该属性或属性的组合为关系模式B的外码，也称为外部关键字或外键 一个关系就是一张二维表，由行和列组成，一般关系的一行称为一个元组，关系的一列称为一个属性，实际上的关系就是物理存储中的表的概念，同样的，关系中的一行对应表中的一行概念为记录，关系中的一列对应表中的一列概念为字段关系代数： 关系代数包括四种运算符：（1）集合运算符：常用操作包括交、并、差、笛卡尔乘积 （2）关系运算符：常用操作包括选择，投影和连接 （3）比较运算符：常用操作包括&gt;、 &gt;=、 &lt; 、&lt;=、 =、 != （4）逻辑运算符：常用操作包括与、或、非 一般比较运算符和逻辑运算符是设置在集合运算和关系运算中的辅助操作，逻辑运算的与和或可以连接多个条件","pubDate":"Tue, 26 Sep 2017 03:12:48 GMT","guid":"//litten.me/2017/09/26/数据库/","category":""},{"title":"计算机基础01","link":"//litten.me/2017/09/12/计算机基础01/","description":"1946年产生人类第一台数字电子计算机，称为ENIAC，主要用于科学计算 计算机发展的四个时代，用电子元器件进行划分，包括电子管时代，晶体管时代，集成电路时代和大规模集成电路时代 计算机的分类：按照计算机的大小划分为巨型机、小型机和微型机，PC机是微机 按照用途划分为通用计算机和专用计算机按照原理划分为数字计算机和模拟电子计算机 计算机的应用包括： 计算机最基本的应用为科学计算 计算机最主要的应用为信息(或数据)处理 计算机包括的辅助功能有：CAD(辅助设计)、CAT(辅助测试)、 CAL(辅助学习)、CAM(辅助制造)、CAI(辅助教学) 计算机的发展趋势： 巨型化（表示功能）、微型化（表示体积）、多媒体化和网络化 计算机系统的组成： 计算机系统由硬件系统和软件系统组成，其中硬件主要由主机和外设组成， 主机包括中央处理器（也称为CPU）和内存（也称为主存）组成，CPU由运算器和控制器组成 ，运算器主要能够执行算术运算和逻辑运算，控制器由程序计数器、指令寄存器、指令译码器、 时序产生器和操作控制器组成，完成协调指挥计算机系统的操作。 内存主要由随机存取存储器（简称RAM）和只读存储器（简称ROM）组成，在系统断电的前提下， RAM中的信息会全部丢失，ROM中的信息不会丢失。外设主要由输入设备和输出设备组成， 同时还包括外部存储器（如硬盘等），输入设备包括键盘、鼠标、摄像头、光笔、扫描仪、手写输入杆 、游戏杆、语音输入装置等；输出设备包括显示器、打印机、绘图仪、影像输出系统、 语音输出系统和磁记录设备等 软件系统由系统软件和应用软件组成 在中央处理器和内存之间存在高速缓冲存储器，解决CPU和内存速度不匹配的问题 冯·诺依曼计算机在世界上第一次提出计算机硬件系统由五部分组成，分别是 运算器、控制器、存储器、输入设备和输出设备 计算机的基本工作原理主要包括指令和程序，指令是包括操作数和操作地址的一组代码，程序是指令的集合 计算机语言发展的基本历程包括： 机器语言、汇编语言和高级语言，汇编语言应用了助记符 计算机系统中的数据单位包括： （1）位：bit，代表计算机中的一位，值为0或1，是计算机系统存储的最小单位 （2）字节：Byte，1Byte=8bit，即一个字节占8位，是计算机系统存储最基本的单位 （3）字：Word，1Word=2Byte，即一个汉字占2个字节 （4）其他相关数据存储的单位换算 1KB=1024B 1MB=1024KB 1GB=1024MB 1TB=1024GB 计算机中表示字符用ascii码，一个ascii码占1个字节的长度，但是ascii码的最高位永远为0，因此ascii码的值为0~127，注意在ascii码表中前32个字符是无法打印的，第一个能够被打印出来的为ascii码值为32的空格 汉字编码包括外码、交换码、机内码和字形码 （1）外码：也称为输入码，是用来将汉字输入到计算机中的一组键盘符号 常见输入码包括拼音码、五笔字形码、自然码、表形码、认知码、区位码和电报码 （2）交换码（国标码）：中华人民共和国国家标准GB2312_80 （3）机内码：在微机内部的汉字代码 （4）汉字字形码：汉字的输出码，采用图形方式，将笔划写在16*16点阵中 （5）汉字地址码：汉字库存储汉字字形信息的逻辑地址码 注意国标码分两级：一级汉字和二级汉字 GBK字符集：国家标准扩展字符集 CPU是计算机系统的核心部件，主要的性能指标包括主频和字长，主频代表一个时钟周期内，计算机CPU能够完成的操作次数，其单位为MHz；字长是计算机CPU能够一次处理的二进制位数 内存的性能指标包括容量和运算速度，所谓内存的运算速度即为单位时间内，内存能够执行的指令条数 计算机总线包括三种：分别是 控制总线、地址总线和数据总线 计算机病毒的特性包括： 传染性、隐蔽性、破坏性、潜伏性和变异性 计算机病毒的分类： 按照破坏性分为：良性病毒、恶性病毒、极恶性病毒和灾难性病毒 按照传染方式分为：引导区型病毒、文件型病毒、混合型病毒和宏病毒 按照连接方式分为：源码型病毒、入侵型病毒、操作系统型病毒和外壳型病毒 关于输入法切换操作问题： （1）中英文输入法切换：ctrl+空格 （2）输入法的切换：shift+ctrl （3）全半角的切换：shift+空格 （4）中英文标点符号切换：ctrl+. 国际标准化组织ISO提出了OSI开发系统互连参考模型，将计算机网络的通信协议从低到高分为七个层次，分别是 物理层，数据链路层，网络层，传输层，会话层，表示层和应用层 机器数包括两种： 有符号数和无符号数， 有符号数则最高位代表符号位，0代表正数，1代表负数；无符号数则对应数值所有位都为数值本身 数据包括整数和小数，整数即为机器数，小数即为定点数和浮点数，如果小数点位置固定，则称为定点数；小数点位置不固定的数称为浮点数，一般在表示浮点数时，常用科学计数法科学计数法的表示方法： 用e或E代表10，在E或e前面是一个小数，在E或e后面是一个整数n，代表10的幂指数， 如果n为正数，则代表乘以10的正n次幂，如果n为负数，则代表乘以10的负n次幂 进制的转换问题 最基本的进制转换操作为十进制与二进制之间的转换 （1）十进制转换为二进制 十进制整数部分做除以2取余数逆序输出操作， 十进制小数部分做乘以2取整数正序输出操作 （2）二进制转换为十进制 二进制整数部分做对应位乘以2的正n-1次幂相加操作，二进制小数部分做对应位乘以2的负n次幂相加操作 所有的进制都可以与二进制之间进行转换，即二进制为媒介 八进制和二进制之间的转换 （1）八进制转换为二进制：八进制的一位，二进制用三位表示 八进制 二进制 0 000 1 001 2 010 3 011 4 100 5 101 6 110 7 111 注意：如果在八进制转换为二进制的过程中，二进制整数部分开头的0可以省略，二进制小数部分结尾的0可以省略 （2）二进制转换为八进制 二进制转换为八进制的操作为二进制三位，用八进制一位表示，对应关系如（1），操作过程为二进制整数部分从右向左看位数，不足位则前补0，二进制小数部分从左向右看位数，不足位则后补0 十六进制和二进制之间的转换 （1）十六进制转换为二进制 十六进制的一位，二进制用四位表示 十六进制 二进制 0 0000 1 0001 2 0010 3 0011 4 0100 5 0101 6 0110 7 0111 8 1000 9 1001 A 1010 B 1011 C 1100 D 1101 E 1110 F 1111 （2）二进制转换为十六进制 二进制转换为十六进制的方式为二进制的四位，十六进制用一位表示，对应二进制整数部分从右向左操作，不足位前补0，二进制小数部分从左向右操作，不足位后补0 (11001101.1011)B=(205.6875)D=(CD.B)H=(315.54)O (52.6)O=(101010.11)B=(42.75)D=(2A.C)H (99.9375)D=(63.F)H=(1100011.1111)B=(143.74)O (A8.4)H=(168.25)D=(250.2)O=(10101000.01) 计算机中有一种编码格式为BCD码，也称为8421码，该编码方式为用四位二进制数表示一位十进制数（不涉及到进位等操作）0：数字，采用数值编码格式‘0’：字符，采用ascii码格式注意字符0的ascii码值为48，之后数值逐一ascii码值+1，大写字母A的ascii码值为65，剩余大写字母按顺序逐一+1，小写字母a的ascii码值为97，剩余小写字母按顺序逐一+1注意回收站占据的是硬盘上的一块空间，文件被delete后，会放到回收站中（注意如果是shift+delete则代表彻底删除，文件不在回收站中），该文件可以恢复剪贴板上主要包含的是被剪切或复制的文本信息，在一个剪贴板上可以包含多个复制或剪切的文本内容，剪贴板占据的是内存的一块空间文件是存储在外部存储器上的一组名字不同的信息组合，文件的名称由文件名和文件的扩展名组成，注意在Windows中不区分大小写，即如果保存A.txt，则再创建a.txt代表是同名文件，但是如果创建的是相同文件名，不同扩展名的文件，则可以实现存储，例如同路径下，可以保存A.txt和A.docx文件的扩展名代表了文件的类型，一般文件扩展名为三位，常见的扩展名文件包括 .exe：可执行文件 .sys：系统文件 .com：命令文件 .doc或.docx：Word文档 .xls或.xlsx：Excel表格 .ppt或.pptx：演示文稿文件 .txt：文本文档 文件的查找操作包括全字匹配的精确查找和信息不确定的模糊查找，在模糊查找过程中，需要注意使用通配符操作 ？代表单个字符 *代表多个字符 计算机使用目录树进行文件信息显示的方式，用Windows资源管理器实现打开Windows资源管理器的方式： （1）右键单击开始按钮，选择Windows资源管理器 （2）单击开始按钮，选择所有程序，选择附件，选择Windows资源管理器 资源管理器中的每一个磁盘名为根目录，如果该目录没有展开，则目录名前会有向右指向的空心箭头，展开后，则变为向右下角指向的实心箭头， 同时在Windows资源管理器中能够显示的最底层为文件夹 系统软件包括 操作系统、语言处理软件（如C语言、Java等）、数据库系统软件（VF、SQL Server等）、 操作系统实用程序（如磁盘碎片整理程序等），常用的应用软件包括MS Office，WPS，防病毒软件和防火墙软件等 各种数据在计算机中的存储的数据方式是不同的，数值采用进制存储，字母采用ascii码存储，汉字采用汉字编码存储数值的进制包括： 二进制：计算机的机器语言，常用数值0，1，运算原则逢二进一，表示为B 八进制：常用数值0~7，运算原则逢八进一，表示为O 十进制：常用数值0~9，运算原则逢十进一，表示为D 十六进制：常用数值0~9，A~F，运算原则逢十六进一，表示为H","pubDate":"Mon, 11 Sep 2017 16:15:46 GMT","guid":"//litten.me/2017/09/12/计算机基础01/","category":""},{"title":"英语笔记01","link":"//litten.me/2017/09/11/英语笔记01/","description":"1.The film _before I got to the cinema A already started B starts C had already started D had been started 2.She recommended two books to me,but____of them was interesting A either B both C none D neither 3.Thirty miles___a long way to cover A seem to be B is C are D were 4.Tommy caught the school bus,____ A but Jane didn’t B but so did Jane C and Jane didn’t either D and Jane did either 5.China is one of the largest countries in the world,____9.6 million square kilometers A to cover B covered C covers D covering 6.The railway is_____in about two months A completed B completing C to complete D to be completed 7.The reason ____he was absent from school was that he had been knocked down by a car定语从句（缺不缺成分、搭配） A where B when C why D that 8.I can’t find the key to my office.I ___ it on my way home A would have lost B must have lost C should have lost D ought to have lost 9 some of the listening questions have four choices that sound___a+动词 adj(句末) asleep awake A alike B unlike C likely D like 10.Internet allows one to follow the____ developments in science A latter B latest C later D late 1 语法选择 十大语法模块（教材，真题）2 词性转换（教材）3 阅读理解3篇 3A真题 四级真题及练习4 完形填空 （3A）5 简答题 不超过3个单词6 翻译 (1)翻译选择 英译汉（2）段落翻译 分别计分7 写作 商务英文写作 3A8 词语搭配十大语法模块 动词类 从句类 动词的时态 定语从句 动词的语态 名词性从句（主宾表同） 非谓语动词 状语从句 虚拟语气 其他类 主谓一致 反义疑问句 倒装 语法选择词性转换写作时态和语态并行做动词题目的步骤 1. 找时间状语 2. 如果是从句要注意背景动词 3. 主动和被动 4. 动作有没有先后 时态完成体现在完成时 have/has +done 过去完成时 had done 将来完成 will have done Recently I have been an English Since I graduated from college Since Daqing oilfield opened up 虽然没有时间状语但是产生结果，翻译成已经 Over the past five years 词性转换名变形 形变名 Ce(结尾的名词)变成形容词 见到ce 变成t T结尾的形容词变名词 见到t 变ce Evidence Different Suggest 表明或者暗示 The cause of his illness 第一最好和最糟 完成时态少不了 序数词 最高级 现在完成时答题注意时间状语和单三 This was the third time that he had been late 1.本来打算 had done I had thought/I had hoped 动词变成名词 T 结尾的动词 变名词+ion Te结尾的动词 去e + ion 其他字母+e ze fe we 去e +ation Modernization Expection Thought 想法理论 This is my thought I will/am going to I plan to 虚拟语气时间愿望和宁愿虚拟时态要倒退 看到现在想过去 看到过去想过完 动作发生的早 用过完 John told____(tell)me that he had server_____(serve)in the army for ten yearsBefore句子考过完 到了那时再去看，将来完成will have done By the time+(将来时间) By the time of next year I will have worked By the time +(过去时间) BY the time of the end of last year I had been a teacher Leave for Production 进行体 现在进行时 过去进行时 将来进行时 will be doing 完成进行时 have been doing/done 进行时有时要根据句意来判断People who have been to London always complain (complain)about the weather there两种分类 一 简单句 一个主语 +一个谓语二 复合句 有连接词 （定语从句除外）He is smiling forever He is not crying forever 感官动词无进行时态Satisfaction Hatred When 和while引导的时间状语从句表示动作同时发生 一定有进行时 I am listening to music while I am doing homework 瞬间动词表将来 1 将来 2 时间点 3 正在发生 4.有时表示事先计划好的事情 I will be watching TV news at 7 tonight Mary will be playing the violin the whole day tomorrow Have been doing have done 1 过去发生 2 现在进行 3 将来延续 I have been being a teacher for 10 The pipe had been leaking(leak)for 2 hours ,and I considered that…….. Have been done(被动语态) had ｂｅｅｎ ｄｏｉｎｇ 完成进行 用在等人 表示不满 一般体 一般现在时 常态 Part partial Agree agreement 客观事实和普遍真理 主将从现 关系词后的是从句 If 引导条件状语从句1 真实条件句（主将从现） 2 非真实条件句（虚拟语气） As 作为 当。。。时候 因为 Not ….. unless I will not lend you my computer unless you treat me for meal My treat 一般过去时虚拟语气 时态倒退 时间 It’s high time (到了。。。的时候了) It’s about the time Take effective measures to do something(采取措施) Effective 果 effect Efficient 效率 efficiency ###愿望和宁愿 Used to do（曾经）used to doing 习惯于 be used to do 被用于 一般将来时Will be going to be about to be to do I was to start my own biz I would start my own biz I was going to I am about to 过去将来时while 两个意思一个是当。。。时候 另外一个是尽管 直译 电视机去完全取代 Came to the door 不是同时发生因为选项当中无进行时 Just 完成时 Just have done came Non-stop Refuel Since现在完 Reach the conclusion Come to a conclushin 注意意思相近和相反的选项 Did know 从句优先翻 ｔａｋｅ place无被动 从句语序一定是陈述语序 主谓宾 将来计划好的事情 Cheated was cheating solve would try ee服从者 employee criticize critic pleased inde acknowledge 动词 person personal personality 日常必需品 必要性 Meaningless Electric guitar Electrician Historic event Time timeless Likely Costly Weekly Strong Large enlarge Irregular Regulation Industry()行业 Industrious勤奋的 Industrialization Besides(还有) except （没有）（同类） except for （不同类的排除） I work everyday except Sunday The office is empty,____ Mary But On Sunday morning With pen By meter 解题步骤Step 1 分析选项意思相近或者相反的选项 绝对选项绝对不选（only never,always,nobody） 找出哪些选项讲的是一回事儿 Step 2 找到题干当中的定位词Step 3 根据选项分析题的类型再作答题的类型1.主旨大意 点面原则 选择涵盖范围最广的或者说得意思最笼统的选项 位置 句首二句 最后一段 2. 推断题 infer 原文当中的内容和选项一样的 绝对不选 3 细节题 分析选项找原文 3. 观点态度 neutral 、indifferent 5 语义题 将选项代入原文 强逻辑关系词周围有设题点Although but however,yet,while What’s more furthermore What can we learn about Tear donw 通过之前答题用过的句子推理 出现的频率最高的词是正确选项 找到答案的句子画出来 翻译为主 自拟内容为辅 不要漏项（审题很关键） 审题步骤判断题材把题目中的内容标注1,2,3分析哪些需要自拟 高分作文的标准 复合从句 过度的连接词 被动语态、倒装是加分项 格式 Dear sir or madam 日期右上角 月日年 右下角 yours sincerely yours Yours faithfully 邀请信 格式Dear 被邀请人 右上角要表明邀请人的职位和公司+日期不能少 Manager Human resources department Dong fang Group/corporation Dec.13th , 2011 Manager Personnel Department Dear sir or madam 写信的时候要学会直接表达目的I am writing to I would like to 1.I am writing to invite you to attend the workshop over/about/on/concerning personnel management which will be held from January 3rd to 4th 2012 at Youyi Hotel in Binhai. 2.We will mainly discuss something about the new mode and method/approach/thought of personnel management in the new situation 密切关注words for reference 3.Besides/in addition/additionally The keynote speaker is professor Dingyi who is from Management department of Binhai university 4. The outlines of the speech written by people who are to take part in the workshop are expected to/should be sent to Human resources department office of Dongfang company before December 20 th 5.By the way,please inform me whether you will attend the meeting or not. I am looking forward to your reply yours Jianguo zhang 发信人的人名写在右上角 日期 Dear peter I would like get more information about your latest laser printer. Please provide me the recent pricelists and the situation of your after sale service. I am lookingforw","pubDate":"Mon, 11 Sep 2017 15:07:48 GMT","guid":"//litten.me/2017/09/11/英语笔记01/","category":""},{"title":"我的blog诞生记","link":"//litten.me/2017/09/11/我的blog诞生记/","description":"我的blog诞生记 经历了3个小时的煎熬,终于弄好了HEXO+GITHUB的搭建,正好随笔记录一下其中的问题 1 版本问题 由于Node.JS有Current和LTS版本,这两个不要搞错了,一定要用LTS版本的 这个问题导致了npm install 会卡住等问题(也许是我网络卡-_-) WINDOWS版GIT到是没碰到什么问题,网上有很多教程,注意去查阅就好 2 安装问题 电脑上由于有hadoop,所以npm的时候 hadoop好像也会安装,但是WINDOWS版本的hadoop好像并不会识别Program Files,会导致一直安装失败,google了一下说是需要缩写成progra~1,但是我的失败了..所以我给我的HADOOP删掉之后重新安装了,装好之后再恢复就ok了 3 关于主题 主题的话 去HEXO官网,里面有很多主题,一般都会有使用教程,按照里面的说明去使用就好了 4 为什么要搭建blog 由于使用微博之类的,难免别人的文章会被删除之类的..搭建自己的blog的话,不会出现这种问题,这算是优势之一吧 我的blog会不定期更新,写一些上课的资料什么或者网上看到的好文章,也希望和各位交流沟通 各位如果有什么希望或者建议,欢迎加我微信a15241270352或者发邮件2280121543@qq.com一起交流","pubDate":"Mon, 11 Sep 2017 02:53:00 GMT","guid":"//litten.me/2017/09/11/我的blog诞生记/","category":""},{"title":"反击爬虫，前端工程师的脑洞可以有多大？","link":"//litten.me/2017/07/09/prevent-spiders/","description":"—— 同时发表于imweb.io 1. 前言对于一张网页，我们往往希望它是结构良好，内容清晰的，这样搜索引擎才能准确地认知它。而反过来，又有一些情景，我们不希望内容能被轻易获取，比方说电商网站的交易额，教育网站的题目等。因为这些内容，往往是一个产品的生命线，必须做到有效地保护。这就是爬虫与反爬虫这一话题的由来。","pubDate":"Sun, 09 Jul 2017 02:36:00 GMT","guid":"//litten.me/2017/07/09/prevent-spiders/","category":"安全,前端"},{"title":"失眠故事五【花匠与候鸟】","link":"//litten.me/2017/06/05/my-fairy-tale4/","description":"一、每个春天，候鸟都会来到这片花田。每个不是春天的季节，花匠总在认真地打理花田。花匠想让一切看起来未来可期，因为他喜欢这只候鸟。喜欢，是因为他们都爱花。那些关于花的话题，他们永远聊不完。 有一个春天，候鸟跟花匠说起了她家乡的雪莲。这种花，花匠从来没听说过。但每次说起雪莲，花匠都能注意到她眼中飞扬的光亮。是的，那是候鸟最心爱的花儿。","pubDate":"Sun, 04 Jun 2017 19:55:00 GMT","guid":"//litten.me/2017/06/05/my-fairy-tale4/","category":"故事"},{"title":"江南见闻","link":"//litten.me/2017/05/22/diary-2017-0521-0527/","description":"扬起帆这个4月真的特别丧…开心的事情屈指可数，貌似也只有朴树的新专辑了。 病后状态一直不好，工作时脑后阴风习习bug，变成了巨大的飞蛾，每每衔着灵魂四方飘游。周四晚，无耻地逃了一个会议下班，拖着疲惫的身体，径直就飞往了杭州。 都这么累了，问自己为什么又在路上了呢？可能只是我觉得，旅行的时候不用去想以前和以后。但旅行那么短，而生活那么长那就更应该不停的出发吧？即使只是一场短暂的幻觉。 我这么想着的时候，这场幻觉正变得越来越真实。凌晨让头脑额外清醒，飞机下出现了新城灯火穿透了夜色与云层，越来越浓，背后的飞蛾被引诱扑了下去——烟消云散。","pubDate":"Mon, 22 May 2017 02:36:00 GMT","guid":"//litten.me/2017/05/22/diary-2017-0521-0527/","category":"旧事"},{"title":"病中记 4.16-4.22","link":"//litten.me/2017/04/22/diary-2017-0416-0422/","description":"4月马上就要过去似乎日历上，径直就能从3月翻到5月。时间怎么这么快？ 长眠于4月之前的海子，对于时间，有一个生动的说法叫“打马而过”有时觉得，这种匀速流淌不可变的东西，才是真TM的残忍。长江水的结局，就是流到太平洋没有任何意外能让它流到大西洋 所以你说，有时意外的中断多可爱？红绿灯多好呀，给你走走停停的机会小病多好呀，静下来休息和幻想悲伤多好呀，欢乐可放歌，悲伤可饮酒 工作忙完了这阵子那条安静而蜿蜒的时间之河，好像真的幻化成了打马的鞭子梦中啪的一声惊响，病倒了。","pubDate":"Sat, 22 Apr 2017 02:36:00 GMT","guid":"//litten.me/2017/04/22/diary-2017-0416-0422/","category":"旧事"},{"title":"我与《刺客信条》 3.5-3.11","link":"//litten.me/2017/03/12/diary-2017-0305-0311/","description":"一这周感觉我的vscode已经“玩得贼6”一切来之不易，毕竟是五次卸载sublime改掉的习惯。不过这丝毫不影响我对sublime的喜爱有人问为什么？没法解释。大话西游里也曾说喜欢一个编辑器需要理由吗？ 但有点令人沮丧的是，“喜欢”这件事确实是会变的。 我有另外的感受，特别是在这周迫不及待地把《刺客信条》电影看完的时候…感觉特别的失望。就是那种经行漫长的等候，期待一场肆无忌惮的雨最后只听到了低沉雷声的空洞感。但是，我也一曾很喜欢这个系列啊。 可能，再也不会有一款游戏，能给我带来这样的触动了吧。五年前，我还写过点文字《记“刺客信条”三部曲：水月镜像，无心去来》。","pubDate":"Sun, 12 Mar 2017 02:36:00 GMT","guid":"//litten.me/2017/03/12/diary-2017-0305-0311/","category":"游戏,旧事"},{"title":"决战前后 2.12 - 2.18","link":"//litten.me/2017/02/19/diary-2017-0212-0218/","description":"终于是把T3评审的事情忙完周末躺在床上整个人都不想动，空虚无比，宛如智障。这种状态，只有高考结束时出现过那时我的日记里写着：“我站在太阳下，就是金灿灿的咸鱼；我躺在被窝里，就是阴绵绵的豆腐脑…”别说这是神比喻。 因为这次评审，确实耗费了挺大的精力关键还是在年后返工的第一周，你正吃着元宵唱着歌突然跑出个班主任说：咱放完寒假就高考，好吗？好生气哦，但还要保持微笑。况且想想，年终奖好像还没发哎…","pubDate":"Sun, 19 Feb 2017 02:36:00 GMT","guid":"//litten.me/2017/02/19/diary-2017-0212-0218/","category":"旧事"},{"title":"美丽新世界","link":"//litten.me/2017/02/10/brave-new-world/","description":"痛仰有一首歌，叫《美丽新世界》，它其实是向80年前赫胥黎的同名小说致敬。歌里唱道：“这是一个离奇的梦也是冒险者的乐园不在乎你在不在乎新的世界依旧美丽…” 乌托邦如此美好，但在那里，幸福的人们全都是“被幸福的”。你的在乎与否无关紧要，只需要按照秩序继续漫步。 春节把《西部世界》看完，它的一些设定，也很容易看出致敬小说的意思，却又带来了另外的惊喜。片尾Dolores的惊艳一枪尘埃落定，现在已经过去一段时间，花哨的剪辑褪出了印象，细微的东西反而更加深刻了。还是想谈一谈这部作品。(含剧透…)","pubDate":"Fri, 10 Feb 2017 02:36:00 GMT","guid":"//litten.me/2017/02/10/brave-new-world/","category":"杂谈,笔记"},{"title":"回乡偶书 1.18 - 1.25","link":"//litten.me/2017/01/26/diary-2017-0118-0125/","description":"年底恰逢乔迁，回去得比较早。其实也算不上乔迁，爷爷的旧宅子，父辈兄弟合力，翻修重建多了一个出逃城市，到乡村度假的地方。当它以新面貌出现在眼前时不免真的觉得衰败的新生相当感慨。 特别是在年底，这个喜旧迎新的时节好像很多往事，被年关一催，不断提纯又沉淀出了最好的那部分。然后你看着它，只能很简单又笃定的说一声：好棒哦！ 但说起新居入伙，有件事我想起就想笑。大概10岁时，第一次搬家，有个迷之仪式印象太深刻。按着习俗，我左手要拿着一根葱，葱通聪，象征聪明伶俐右手拿一根蒜，蒜通算，意思是会算术。这活脱就是一羞耻的莹草cosplay啊","pubDate":"Thu, 26 Jan 2017 02:36:00 GMT","guid":"//litten.me/2017/01/26/diary-2017-0118-0125/","category":"旧事"},{"title":"薛定谔的年 1.1 -1.7","link":"//litten.me/2017/01/08/diary-2017-0101-0107/","description":"传说中，现在这段元旦到除夕的时间由于不知该称之“今年”或“明年”有人就说，叫薛定谔的年好了！这么一想，好像许多东西都可以跟薛定谔扯上关系。 比如这周，每天醒来第一件事就是到12306查一下有没有薛定谔的票有了，就输入那个神才知道对不对的薛定谔验证码去完成这笔的鬼才知道成不成功的薛定谔订单 这世道，上半年的代码，到下半年能不能编译都要打个问号就不要试想真切地看清这繁花世界啦。Mr.Big不断重复着：Oh baby baby it’s a wild world…有时候发现我等的就是这几个字。","pubDate":"Sun, 08 Jan 2017 02:36:00 GMT","guid":"//litten.me/2017/01/08/diary-2017-0101-0107/","category":"旧事"},{"title":"旧事 年末","link":"//litten.me/2016/12/31/diary-2016-1225-1231/","description":"每年这个时候都要趴在这座天桥，拍一张照看着这个世界似乎没变，但又在喧哗和前行。 这年成长了挺多，也学会看淡一些事情可能是代码写多了，感觉世界的逻辑有时很简单。事情无非是let，变化历历或者是const，永恒安息 如果一开始就想清楚，留不住的就随风去，不会变的就钉到骨子里。那你说多轻松。","pubDate":"Sat, 31 Dec 2016 02:36:00 GMT","guid":"//litten.me/2016/12/31/diary-2016-1225-1231/","category":"旧事"},{"title":"旧事 回以沉默 11.12-11.19","link":"//litten.me/2016/11/20/diary-2016-1112-1119/","description":"17号，回华科。和上一次不一样，这次多了点儿使命感：做一次前端技术演讲。 学生时代，我听过无数场分享。总觉得台上高谈阔论嘉宾，离我实在太远。一次分享，一别两端，然后各自回到自己的生活轨道，再无交集。或者是我没有入心。 但想不到，这么快台上的这个人就该是我了。仿佛晚会还在继续，帷幔也没收起。魔术师说，天色还早呀，我再给你们变个魔术吧烟雾腾空，灯光明灭，时间掠影而过我本来是台下端坐的观众，一下子就站到了台上主持人把话筒一递，说，该你了。","pubDate":"Sun, 20 Nov 2016 02:36:00 GMT","guid":"//litten.me/2016/11/20/diary-2016-1112-1119/","category":"旧事"},{"title":"旧事 哪天才能歌唱的话 10.30-11.05","link":"//litten.me/2016/11/06/diary-2016-1030-1105/","description":"想起网易账户密码泄露，就发生在10月底。去年的这个时候，我是受害者之一。 但我没有着急改密码。一是因为那个时候，我过着一种近乎抑郁灰白的生活。所有的社交工具都停掉了，也不与人交流。很多事情我不愿碰。像燃尽的烟柱，自己伸手一掸，搞不好满世界尘埃还不如让风来悄悄瘗埋。 二是因为一位神秘的朋友闯进了生活。我很喜欢冲绳民谣，在云音乐里上传了BEGIN的《三线の花》与《笑颜不变》。这位朋友搞到我的账号密码后，貌似没做什么坏事，光给我推荐歌曲了…TA先上传了没有版权的《岛人ぬ宝》，再后来是夏川和中孝介的一些歌。那时，这些音乐，居然成了我跟外界连通的唯一绳索。","pubDate":"Sun, 06 Nov 2016 02:36:00 GMT","guid":"//litten.me/2016/11/06/diary-2016-1030-1105/","category":"旧事"},{"title":"旧事 木头人 10.23-10.29","link":"//litten.me/2016/10/30/diary-2016-1023-1029/","description":"10月的最后一周，想在天气变冷前，完成一组照片。主题跟树林有关，因为我很喜欢这个季节树叶的厚重感。不过，木头比人难拍太多了。人非草木，起码有表情，有温度，可以装扮。有两次回来，我直接就把照片全删了，心情不太爽，怎么想都是这些树木不配合。 后来妥协，是不是我得自己做些改变，营造一种拟人的环境呢？因此按快门时，我都很平常的喊一声：“一二三茄子！”那时天色已黑，别人一看这里没人啊…吓坏了两个孩子。对不起！ 另外，一个很重要的经验去小树林记得要带six god…","pubDate":"Sun, 30 Oct 2016 02:36:00 GMT","guid":"//litten.me/2016/10/30/diary-2016-1023-1029/","category":"旧事"},{"title":"旧事 荔枝永远红不了 10.16-10.22","link":"//litten.me/2016/10/23/diary-2016-1016-1022/","description":"这只猫，是我在公园认识的。一年前它还很小，每天穿行于古旧的荔枝林。傍晚我习惯到公园跑步，总能在固定的地点，看到阳光把它拉成巨大猛兽的情景。然而它更喜欢阴影。 第一次碰到它，他就躲在阴影里。因为是在车底，给它起了个名字叫阿杜…（逻辑满分，拒绝吐槽）","pubDate":"Sun, 23 Oct 2016 02:36:00 GMT","guid":"//litten.me/2016/10/23/diary-2016-1016-1022/","category":"旧事"},{"title":"旧事 返校日 10.8-10.15","link":"//litten.me/2016/10/20/diary-2016-1008-1015/","description":"“我要回武汉！”这句话说了一千遍，终于兑现成一张动车票。 三年前，毕业的第二天，行李被盗，大学时所有的物件付之东流。背着空空的行囊回家，越想越委屈，导演剧本不对啊，人家西游记八十一难，好歹是个HAPPY ENDING…感觉自己有一种迷之体质，总可以把平静的生活过得波澜壮阔。左脸黑线，右脸微笑，这种技能不是谁都可以，我在考虑要不申个遗。 总之，国庆后大家都返工，过上岁月静好的生活时，我一个人扛起了到武汉搞事情的大旗。","pubDate":"Thu, 20 Oct 2016 02:36:00 GMT","guid":"//litten.me/2016/10/20/diary-2016-1008-1015/","category":"旧事"},{"title":"旧事 Way Home 10.1-10.7","link":"//litten.me/2016/10/08/diary-2016-1001-1007/","description":"《Way Home》是押尾的一首指弹，算不上热门，听的人也少。我不喜欢一首吉他曲太过工整，羽翼丰满的老鹰，就没有了小鸟的自在。不过，教科书般的工整，就有一种禁锢的美感。音符好似尺子上的刻度，不差分毫。如果时间也是一把尺子，那回家这件事也应该是清晰有力的刻度吧。 九月的最后一天，听着它，回了家。 推开门，好像一个转场回到从前，书包一丢，喊一句：我回来了，好累啊然后倒在沙发上等吃的，电视上正放着《数码宝贝》。这才应该是那个“无限大な梦”啊！","pubDate":"Sat, 08 Oct 2016 02:36:00 GMT","guid":"//litten.me/2016/10/08/diary-2016-1001-1007/","category":"旧事"}]}